{
    "metadata": {
        "source": "../data/tr/bilkent-turkish-writings/btwd_default_final_sample.json",
        "processor": "tr_morph",
        "language": "tr"
    },
    "data": [
        {
            "id": "tr-btwd-id-0",
            "original_root": null,
            "root": "devam",
            "pos": "N",
            "suffixes": [
                "ı"
            ],
            "derivation": "devamı",
            "options": [
                "devamı"
            ],
            "answer": "The suffix given is ı. By appending ı to the word root devam, we get devamı. The suffix ı is used only once. The provided suffix ı is used. No extra suffixes are included. The word devamı is grammatically correct. The word devamı complies with all the rules. <devamı>",
            "meta_suffixes": [
                "YH"
            ],
            "sentence": "plüton bize ilk dersini verdi ___ da gelecek",
            "meaning": null
        },       
        {
            "id": "tr-btwd-id-69",
            "original_root": null,
            "root": "birlikte",
            "pos": "Adv",
            "suffixes": [
                "liğ",
                "imiz"
            ],
            "derivation": "birlikteliğimiz",
            "options": [
                "birlikteliğimiz",
                "birlikteimizliğ"
            ],
            "answer": "The suffix given are liğ and imiz. By appending liğ and imiz to the word root birlikte, we get birlikteliğimiz. The provided suffixes liğ and imiz are used only once. No extra suffixes are included. The word birlikteliğimiz is grammatically correct. The word devamı complies with all the rules. <birlikteliğimiz>",
            "meta_suffixes": [
                "lHk",
                "HmHz"
            ],
            "sentence": "sanırım yıllar süren ___ sonucunda onun bana zarar vermeyeceğine karar verdim ve ona güvendim",
            "meaning": null
        },
        {
            "id": "tr-btwd-ood-56",
            "original_root": "geçin",
            "original_derivation": "geçinirken",
            "root": "hüdin",
            "pos": "V",
            "suffixes": [
                "ir",
                "ken"
            ],
            "derivation": "hüdinirken",
            "options": [
                "hüdinirken",
                "hüdinkenir"
            ],
            "answer": "Answer: The suffix given are ken and ir. By appending ir and ken to the word root hüdin, we get hüdinkenir. The provided suffixes ken and ir are used only once. No extra suffixes are included but the word is not grammatically correct. Let's try another order. By appending ken and ir to the word root hüdin, we get hüdinirken. The provided suffixes ken and ir are used only once. No extra suffixes are included. The word hüdinirken is grammatically correct and complies with all the rules. <hüdinirken>",
            "similar": null,
            "meta_suffixes": [
                "Hr",
                "ken"
            ],
            "sentence": "kardeş kardeş ___ nasıl her yıl bir moriskoluyu yakmayı adet edindiler",
            "meaning": null
        }]
}